module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "𝐏𝐫𝐢𝐲𝐚𝐧𝐬𝐡 𝐑𝐚𝐣𝐩𝐮𝐭",
    description: "War in group boxchat",
    commandCategory: "group",
    usages: "bold war",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("Listen to your father, kids !");
setTimeout(() => {a({body: "ਤੇਰੀ ਓਸ ਮਾ ਦੇ ਹੱਥਾ ਚ ਲੰਨ ਜਿਸ ਦੇ ਹੱਥਾ ਚ ਤੂੰ ਖੇਡ ਦਾ ਰਿਹਾ ਫੁੱਦੀ ਦਿਆ 😜❤️🤚" })}, 3000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦੀ ਛਾਤੀ ਚ ਲੱਤਾ ਮਾਰਾ ਸੁਣ ਫੁੱਦੀ ਦਿਆ 😜❤️🤚"})}, 5000);
setTimeout(() => {a({body: "😜❤️🤚 ਤੇਰੇ ਰਖੜੀ ਬੰਨਣ ਵਾਲੀ ਤੇਰੀ ਗਸਤੀ ਭੈਣ ਨੂੰ ਲੰਨ ਦਵਾ ਫੇ ☺️💖" })}, 7000);
setTimeout(() => {a({body: "ਤੇਰੀ ਨਰੇਗਾ ਚ ਲੱਗੀ ਮਾ ਨੂੰ ਲੰਨ ਦਵਾ ਨੱਸਦਾ ਕਿੱਥੇ ਆ 😜❤️🤚" })}, 9000);
setTimeout(() => {a({body: "ਤੇਰੀ ਰਾਹ ਜਾਂਦੀ ਭੈਣ ਦੇ ਦੁੱਧੂ ਨੱਪ ਦਵਾ ਦੱਸ ਜਾਨ 😜❤️🤚?" })}, 12000);
setTimeout(() => {a({body: "ਤੇਰੀ ਫੈਕਟਰੀ ਚ ਕੰਮ ਕਰਨ ਵਾਲੀ ਮਾ ਮਨਾ ਲਵਾ ਜਲਦੀ ਦੱਸ ਜਾਨ 😜❤️🤚" })}, 15000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦੀ ਗਿੱਲੀ ਜਹੀ ਭੋਸੜੀ ਚ ਹੱਥ ਪਾ ਦਵਾ 😜❤️🤚" })}, 17000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦੀ ਫੁੱਲਾ ਵਾਲੀ ਕੱਛੀ ਚ ਮੂਤ ਦਵਾ 😜❤️🤚" })}, 20000);
setTimeout(() => {a({body: "ਤੇਰੀ ਭੈਣ ਦੀ ਬੁੰਡ ਮਾਰੀ ਉਧਾਰੇ ਪੈਸੇ ਲੈਕੇ ਗੱਲ ਸੁਣ 😜❤️🤚" })}, 23000);
setTimeout(() => {a({body: "ਤੇਰੀ ਵੱਡੀ ਜਹੀ ਬੁੰਡ ਵਾਲੀ ਮਾ ਨਾਲ ਰੇਪ ਕਰਾ 😜❤️🤚" })}, 25000);
setTimeout(() => {a({body: "😜❤️🤚 ਤੇਰੀ ਅੱਖਾ ਤੋ ਅੰਨੀ ਮਾ ਦੀ ਟੁੱਟੀ ਜਹੀ ਐਨਕ ਚ ਲੰਨ  ਦਵਾ ਉਰੇ ਆ ☺️💖" })}, 28500);
setTimeout(() => {a({body: " ਮਾ ਦੀ ਜਿੰਦਗੀ ਰੋਲ ਦਵਾ ਓਹਦਾ ਰੇਪ ਕਰਕੇ 😜❤️" })}, 31000);
setTimeout(() => {a({body: "ਤੇਰੀ ਜਵਾਨ ਭੈਣ ਦੀ ਫੁਦੀ ਚ ਲੰਨ ਮਾਰਕੇ ਓਹਦੀ ਜਵਾਨੀ ਖਰਾਬ ਕਰ ਦਵਾ ਦੱਸ 😜❤️✋" })}, 36000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦੀ ਫੁਦੀ ਤੇ ਸਬਜੀ ਵੇਚਣ ਆਇਆ ਬਹੀਆ ਚੜਾ ਦਵਾ ਦੱਸ 😜❤️👍" })}, 39000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦਾ ਸ਼ੋਲਾ ਮਾਰਿਆ ਝਾਂਜਰਾ ਤੋਂ ਫੜਕੇ ਓਏ 😜❤️👍" })}, 40000);
setTimeout(() => {a({body: "ਤੇਰੀ ਗਰੀਬ ਘੋੜੀ ਮਾ ਦੀਆ ਆਂਦਰਾ ਪਾੜ ਦੇਣੀਆਂ ਅੱਜ ਮੈ ਪਰੇਗਾ ਖਾ ਕੇ 😜❤️👍" })}, 65000);
setTimeout(() => {a({body: "ਅੱਜ ਜੱਟ ਨੇ ਪਾਗ਼ਲ ਹੋ ਕੇ ਚੜ੍ਹ ਜਾਣਾ ਤੇਰੀ ਸੁੱਤੀ ਪਈ ਮਾ ਉਪਰ 😜❤️👍" })}, 70000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦੀਆ ਸਲਵਾਰਾਂ ਪਾੜ ਦਵਾ ਲੰਨ ਨਾਲ ਗੰਡਾਸਾ ਬੰਨ੍ਹ ਕੇ 😜❤️👍" })}, 75000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦੇ ਵਾਲਾ ਤੋਂ ਫੜਕੇ ਲੱਫੜ ਮਾਰਾ ਦੋਸਤ 🤪❤️✋" })}, 80000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦੀ ਛਾਤੀ ਚ ਲੱਤਾ ਮਾਰਾ ਸੁਣ ਫੁੱਦੀ ਦਿਆ 😜❤️🤚" })}, 85000);
setTimeout(() => {a({body: "ਤੇਰੀ ਨਰੇਗਾ ਚ ਲੱਗੀ ਮਾ ਨੂੰ ਲੰਨ ਦਵਾ ਨੱਸਦਾ ਕਿੱਥੇ ਆ 😜❤️")} , 90000);
setTimeout(() => {a({body: "ਤੇਰੀ ਨਰੇਗਾ ਚ ਲੱਗੀ ਮਾ ਨੂੰ ਲੰਨ ਦਵਾ ਨੱਸਦਾ ਕਿੱਥੇ ਆ 😜❤️🤚" })}, 95000);
setTimeout(() => {a({body: "ਤੇਰੀ ਮਾ ਦਾ ਸ਼ੋਲਾ ਮਾਰਿਆ ਝਾਂਜਰਾ ਤੋਂ ਫੜਕੇ ਓਏ 😜❤️👍" })}, 100000);
setTimeout(() => {a({body: "ਤੇਰੀ ਬਿਨ ਵਿਆਹੀ ਭੈਣ ਨਾਲ ਤਲਾਕ ਕਰ ਲੈਣਾ ਜੱਟ ਨੇ ਸੁਪਨੇ ਚ 😜❤️🩷" })}, 105000);
setTimeout(() => {a({body: "😜❤️🤚 ਤੇਰੀ ਅੱਖਾ ਤੋ ਅੰਨੀ ਮਾ ਦੀ ਟੁੱਟੀ ਜਹੀ ਐਨਕ ਚ ਲੰਨ  ਦਵਾ ਉਰੇ ਆ ☺️💖"})} , 115000);




  
  }
